# MMYOLO YOLO26 detect model
# Raw N-channel input + CBAM after the first shared feature block

nc: 80
end2end: True
reg_max: 1
scales:
  n: [0.50, 0.25, 1024]
  s: [0.50, 0.50, 1024]
  m: [0.50, 1.00, 512]
  l: [1.00, 1.00, 512]
  x: [1.00, 1.50, 512]

backbone:
  - [-1, 1, Conv, [64, 3, 2]]                  # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2]]                 # 1-P2/4
  - [-1, 2, C3k2, [256, False, 0.25]]          # 2
  - [-1, 1, CBAM, [7]]                         # 3
  - [-1, 1, Conv, [256, 3, 2]]                 # 4-P3/8
  - [-1, 2, C3k2, [512, False, 0.25]]          # 5
  - [-1, 1, Conv, [512, 3, 2]]                 # 6-P4/16
  - [-1, 2, C3k2, [512, True]]                 # 7
  - [-1, 1, Conv, [1024, 3, 2]]                # 8-P5/32
  - [-1, 2, C3k2, [1024, True]]                # 9
  - [-1, 1, SPPF, [1024, 5, 3, True]]          # 10
  - [-1, 2, C2PSA, [1024]]                     # 11

head:
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 7], 1, Concat, [1]]                  # 13 cat backbone P4
  - [-1, 2, C3k2, [512, True]]                 # 14

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 5], 1, Concat, [1]]                  # 16 cat backbone P3
  - [-1, 2, C3k2, [256, True]]                 # 17 (P3/8-small)

  - [-1, 1, Conv, [256, 3, 2]]
  - [[-1, 14], 1, Concat, [1]]                 # 19 cat head P4
  - [-1, 2, C3k2, [512, True]]                 # 20 (P4/16-medium)

  - [-1, 1, Conv, [512, 3, 2]]
  - [[-1, 11], 1, Concat, [1]]                 # 22 cat head P5
  - [-1, 1, C3k2, [1024, True, 0.5, True]]     # 23 (P5/32-large)

  - [[17, 20, 23], 1, Detect, [nc]]
